export const PPL_EVENTS = [
  {
    id: 'PRC_E2W4R1Q2I0U4B0O0Y5Q5Z4N6H5E8O7',
    date: '2024-12-04',
    title: '비상계엄해제요구 결의안',
    billNo: '2206197',
    type: 'absent',
    description: '비상계엄해제요구 결의안 표결 불참 국민의힘 의원 90명'
  },
  {
    id: 'PRC_P2U4C1T2Q0J4E1F7B5G6W3L7D1W6P4',
    date: '2024-12-08',
    title: '대통령(윤석열) 탄핵소추안',
    billNo: '2206448',
    type: 'participate',
    description: '대통령 탄핵소추안 표결 불참 국민의힘 의원 105명',
    members: {
        lawmakers: [
          '강대식','강명구','강민국','강선영','강승규','고동진','곽규택','구자근','권성동','권영세','권영진',
          '김건', '김기웅','김기현','김대식','김도읍','김미애','김민전','김상훈','김석기','김선교','김성원',
          '김소희','김승수','김용태','김위상','김은혜','김장겸','김재섭','김정재','김종양','김태호','김형동',
          '김희정','나경원','박대출','박덕흠','박상웅','박성민','박성훈','박수민','박수영','박정하','박정훈',
          '박준태','박충권','박형수','배준영','배현진','백종헌','서명옥','서범수','서일준','서지영','서천호',
          '성일종','송석준','송언석','신동욱','신성범','안상훈','엄태영','우재준','유상범','유영하','유용원',
          '윤상현','윤영석','윤재옥','윤한홍','이달희','이만희','이상휘','이성권','이양수','이인선','이종배',
          '이종욱','이철규','이헌승','인요한','임이자','임종득','장동혁','정동만','정성국','정연욱','정점식',
          '정희용','조경태','조배숙','조승환','조은희','조정훈','조지연','주진우','주호영','진종오','최보윤',
          '최수진','최은석','최형두','추경호','한기호','한지아'
        ]
    }
  },
  {
    id: 'PRC_F2Y4Z1N2G0Y5Q1A4M1O0P4N2I4P3N1',
    date: '2024-12-10',
    title: '위헌적 비상계엄 선포를 통한 내란 행위의 진상규명을 위한 특별검사의 수사요구안 반대 64명',
    billNo: '2206448',
    type: 'absent',
    description: '내란 진상규명 특검 수사요구안 반대 64명'
  },
  {
    id: 'PRC_W2R4D1V2O3C1F1X3Z3P5Z5P6P9Y1Z7',
    date: '2024-12-31',
    title: '내란 혐의 진상규명 국정조사',
    billNo: '2207147',
    type: 'against',
    description: '윤석열 정부의 비상계엄 선포를 통한 내란 혐의 진상규명 국정조사계획서 승인의 건 반대 국민의힘 의원 71명'
  },
  {
    id: 'hannam-defense',
    date: '2025-01-06',
    title: '관저 인간 방패',
    type: 'participate',
    description: '대통령 관저 체포 방해. 국민의힘 의원 45명, 국민의힘 당협위원장 12명',
    members: {
      lawmakers: [
        '강대식',
        '강명구',
        '구자근',
        '권영진',
        '김석기',
        '김승수',
        '김정재',
        '송언석',
        '이만희',
        '이상휘',
        '이인선',
        '임이자',
        '임종득',
        '조지연',
        '최은석',
        '강민국',
        '김기현',
        '김종양',
        '박대출',
        '박성민',
        '박성훈',
        '서일준',
        '서천호',
        '이종욱',
        '정동만',
        '정점식',
        '김선교',
        '김은혜',
        '나경원',
        '윤상현',
        '조은희',
        '강승규',
        '엄태영',
        '장동혁',
        '유상범',
        '이철규',
        '강선영',
        '김민전',
        '김위상',
        '김장겸',
        '박준태',
        '박충권',
        '이달희',
        '조배숙',
        '최수진'
      ],
      partyChairs: [
        '박종진', '이용', '신재경', '하종대', '홍형선', '이상규', '구상찬', '양정무',
        '홍인정', '고석', '심재돈', '심재철'
      ]
    }
  }
]; 